/*
 Глава 14. Упражнение 16.
	Определите класс Conroller, содержащий четыре виртуальные функции: on(), off(),
set_level(int), и show(). Выведите из класса Controller как минимум два класса.
Один из них должен быть простым тестовым классом, в котором функция show() выводит
на печать информацию, включён или выклёчен контроллер, а так же текущий уровень.
Второй производный класс должен управлять цветом объекта класса Shape; точный смысл
понятия "уровень" определите сами. Попробуйте найти третий объект для управления
с помощью класса Controller.
 clear && c++ -o code GUI/Simple_window.cpp GUI/Graph.cpp GUI/GUI.cpp GUI/Window.cpp code.cpp -lfltk -lfltk_images -std=c++11 && ./code
*/

#include "code.h"
#include "cmath"

//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
int main ()
try
{

}
catch(exception& e) {
    return 1;
}
catch(...) {
    return 2;
}

