//
//	Глава 10. Задание 1 - 7
//

#include <iostream>
#include "std_lib_facilities.h"

using namespace std;

//------------------------------------------------------------------------------
/*
	Вводится: $123.45
	123	- доллара
	45	- центов, если будет .4523, то округляется до 45 центов
*/
struct Point {
	int x;
	int y;
	Point(): x(0), y(0) {}
	Point(int x1, int y1): x(x1), y(y1) { }
};

//------------------------------------------------------------------------------
istream& operator>>(istream& ist, Point& P);
ostream& operator<<(ostream& os, const Point& P);
//------------------------------------------------------------------------------

